---
kind: property
id: P:Autodesk.Revit.DB.Events.RevitAPIEventArgs.IsValidObject
source: html/35c0066a-b3dc-9d37-c79e-c29f90713b2d.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventArgs.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.